Revit 2027 API
SolidOrShellTessellationControls Properties
The SolidOrShellTessellationControls type exposes the following members.
Properties
Name | Description
Accuracy |  A positive real number specifying how accurately a triangulation should approximate a solid or shell.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LevelOfDetail |  An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell.
MinAngleInTriangle |  A non-negative real number specifying the minimum allowed angle for any triangle in the triangulation, in radians.
MinExternalAngleBetweenTriangles |  A positive real number specifying the minimum allowed value for the external angle between two adjacent triangles, in radians.
Top
See Also
Reference
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace